notes/import-graph.md
```mermaid
flowchart TD
    n0[shrinkray]
    n1[adaptive_timeout]
    n2[cli]
    n3[formatting]
    n4[history]
    n5[interp]
    n6[interp.client]
    n7[interp.host]
    n8[interp.protocol]
    n9[interp.signals]
    n10[interp.worker]
    n11[passes]
    n12[passes.bytes]
    n13[passes.cpp]
    n14[passes.definitions]
    n15[passes.external]
    n16[passes.genericlanguages]
    n17[passes.json]
    n18[passes.patching]
    n19[passes.python]
    n20[passes.sat]
    n21[passes.sequences]
    n22[passes.treesitter]
    n23[problem]
    n24[process]
    n25[reducer]
    n26[reducers]
    n27[reducers.driver]
    n28[reducers.protocol]
    n29[reducers.python]
    n30[reformat]
    n31[state]
    n32[tui]
    n33[ui]
    n34[validation]
    n35[work]

    n3 --> n30
    n4 --> n2
    n6 --> n8
    n7 --> n9
    n7 --> n10
    n10 --> n2
    n10 --> n8
    n10 --> n23
    n10 --> n31
    n10 --> n35
    n12 --> n18
    n12 --> n23
    n13 --> n14
    n13 --> n18
    n13 --> n23
    n14 --> n23
    n15 --> n23
    n15 --> n24
    n15 --> n28
    n16 --> n12
    n16 --> n14
    n16 --> n18
    n16 --> n23
    n16 --> n35
    n17 --> n14
    n17 --> n18
    n17 --> n23
    n18 --> n23
    n19 --> n23
    n19 --> n35
    n20 --> n14
    n20 --> n18
    n20 --> n21
    n20 --> n23
    n21 --> n14
    n21 --> n18
    n21 --> n23
    n22 --> n14
    n22 --> n18
    n22 --> n23
    n23 --> n3
    n23 --> n30
    n23 --> n35
    n25 --> n4
    n25 --> n12
    n25 --> n13
    n25 --> n14
    n25 --> n15
    n25 --> n16
    n25 --> n17
    n25 --> n18
    n25 --> n19
    n25 --> n20
    n25 --> n21
    n25 --> n22
    n25 --> n23
    n25 --> n35
    n27 --> n14
    n27 --> n23
    n27 --> n28
    n27 --> n35
    n29 --> n19
    n29 --> n27
    n31 --> n1
    n31 --> n2
    n31 --> n3
    n31 --> n4
    n31 --> n13
    n31 --> n22
    n31 --> n23
    n31 --> n24
    n31 --> n25
    n31 --> n35
    n32 --> n3
    n32 --> n6
    n32 --> n8
    n32 --> n9
    n33 --> n23
    n33 --> n31
    n34 --> n2
```
